{"format": "layers-model", "generatedBy": "keras v3.14.1", "convertedBy": "Mapan converter v3.0", "modelTopology": {"class_name": "Functional", "config": {"name": "functional", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"name": "input_layer", "dtype": "float32", "ragged": false, "sparse": false, "batch_input_shape": [null, 224, 224, 3]}, "name": "input_layer", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"groups": 1, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "filters": 32, "use_bias": false, "name": "Conv1", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "strides": [2, 2]}, "name": "Conv1", "inbound_nodes": [[["input_layer", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn_Conv1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn_Conv1", "inbound_nodes": [[["Conv1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "Conv1_relu", "dtype": "float32", "threshold": 0.0, "trainable": false, "max_value": 6.0, "negative_slope": 0.0}, "name": "Conv1_relu", "inbound_nodes": [[["bn_Conv1", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"data_format": "channels_last", "trainable": false, "depth_multiplier": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "name": "expanded_conv_depthwise", "kernel_size": [3, 3], "activity_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "depthwise_regularizer": null, "dtype": "float32", "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "expanded_conv_depthwise", "inbound_nodes": [[["Conv1_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "expanded_conv_depthwise_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "expanded_conv_depthwise_BN", "inbound_nodes": [[["expanded_conv_depthwise", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "expanded_conv_depthwise_relu", "dtype": "float32", "threshold": 0.0, "trainable": false, "max_value": 6.0, "negative_slope": 0.0}, "name": "expanded_conv_depthwise_relu", "inbound_nodes": [[["expanded_conv_depthwise_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"groups": 1, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "filters": 16, "use_bias": false, "name": "expanded_conv_project", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "expanded_conv_project", "inbound_nodes": [[["expanded_conv_depthwise_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "expanded_conv_project_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "expanded_conv_project_BN", "inbound_nodes": [[["expanded_conv_project", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"groups": 1, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "filters": 96, "use_bias": false, "name": "block_1_expand", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block_1_expand", "inbound_nodes": [[["expanded_conv_project_BN", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "block_1_expand_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "block_1_expand_BN", "inbound_nodes": [[["block_1_expand", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "block_1_expand_relu", "dtype": "float32", "threshold": 0.0, "trainable": false, "max_value": 6.0, "negative_slope": 0.0}, "name": "block_1_expand_relu", "inbound_nodes": [[["block_1_expand_BN", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "block_1_pad", "dtype": "float32", "data_format": "channels_last", "trainable": false, "padding": [[0, 1], [0, 1]]}, "name": "block_1_pad", "inbound_nodes": [[["block_1_expand_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"data_format": "channels_last", "trainable": false, "depth_multiplier": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "name": "block_1_depthwise", "kernel_size": [3, 3], "activity_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_regularizer": null, "depthwise_regularizer": null, "dtype": "float32", "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dilation_rate": [1, 1], "strides": [2, 2]}, "name": "block_1_depthwise", "inbound_nodes": [[["block_1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "block_1_depthwise_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "block_1_depthwise_BN", "inbound_nodes": [[["block_1_depthwise", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "block_1_depthwise_relu", "dtype": "float32", "threshold": 0.0, "trainable": false, "max_value": 6.0, "negative_slope": 0.0}, "name": "block_1_depthwise_relu", "inbound_nodes": [[["block_1_depthwise_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"groups": 1, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "filters": 24, "use_bias": false, "name": "block_1_project", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block_1_project", "inbound_nodes": [[["block_1_depthwise_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "block_1_project_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "block_1_project_BN", "inbound_nodes": [[["block_1_project", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"groups": 1, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "filters": 144, "use_bias": false, "name": "block_2_expand", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block_2_expand", "inbound_nodes": [[["block_1_project_BN", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "block_2_expand_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "block_2_expand_BN", "inbound_nodes": [[["block_2_expand", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "block_2_expand_relu", "dtype": "float32", "threshold": 0.0, "trainable": false, "max_value": 6.0, "negative_slope": 0.0}, "name": "block_2_expand_relu", "inbound_nodes": [[["block_2_expand_BN", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"data_format": "channels_last", "trainable": false, "depth_multiplier": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "name": "block_2_depthwise", "kernel_size": [3, 3], "activity_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "depthwise_regularizer": null, "dtype": "float32", "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block_2_depthwise", "inbound_nodes": [[["block_2_expand_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "block_2_depthwise_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "block_2_depthwise_BN", "inbound_nodes": [[["block_2_depthwise", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "block_2_depthwise_relu", "dtype": "float32", "threshold": 0.0, "trainable": false, "max_value": 6.0, "negative_slope": 0.0}, "name": "block_2_depthwise_relu", "inbound_nodes": [[["block_2_depthwise_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"groups": 1, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "filters": 24, "use_bias": false, "name": "block_2_project", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block_2_project", "inbound_nodes": [[["block_2_depthwise_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "block_2_project_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "block_2_project_BN", "inbound_nodes": [[["block_2_project", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block_2_add", "dtype": "float32", "trainable": false}, "name": "block_2_add", "inbound_nodes": [[["block_1_project_BN", 0, 0, {}], ["block_2_project_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"groups": 1, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "filters": 144, "use_bias": false, "name": "block_3_expand", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block_3_expand", "inbound_nodes": [[["block_2_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "block_3_expand_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "block_3_expand_BN", "inbound_nodes": [[["block_3_expand", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "block_3_expand_relu", "dtype": "float32", "threshold": 0.0, "trainable": false, "max_value": 6.0, "negative_slope": 0.0}, "name": "block_3_expand_relu", "inbound_nodes": [[["block_3_expand_BN", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "block_3_pad", "dtype": "float32", "data_format": "channels_last", "trainable": false, "padding": [[0, 1], [0, 1]]}, "name": "block_3_pad", "inbound_nodes": [[["block_3_expand_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"data_format": "channels_last", "trainable": false, "depth_multiplier": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "name": "block_3_depthwise", "kernel_size": [3, 3], "activity_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_regularizer": null, "depthwise_regularizer": null, "dtype": "float32", "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dilation_rate": [1, 1], "strides": [2, 2]}, "name": "block_3_depthwise", "inbound_nodes": [[["block_3_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "block_3_depthwise_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "block_3_depthwise_BN", "inbound_nodes": [[["block_3_depthwise", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "block_3_depthwise_relu", "dtype": "float32", "threshold": 0.0, "trainable": false, "max_value": 6.0, "negative_slope": 0.0}, "name": "block_3_depthwise_relu", "inbound_nodes": [[["block_3_depthwise_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"groups": 1, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "filters": 32, "use_bias": false, "name": "block_3_project", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block_3_project", "inbound_nodes": [[["block_3_depthwise_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "block_3_project_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "block_3_project_BN", "inbound_nodes": [[["block_3_project", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"groups": 1, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "filters": 192, "use_bias": false, "name": "block_4_expand", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block_4_expand", "inbound_nodes": [[["block_3_project_BN", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "block_4_expand_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "block_4_expand_BN", "inbound_nodes": [[["block_4_expand", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "block_4_expand_relu", "dtype": "float32", "threshold": 0.0, "trainable": false, "max_value": 6.0, "negative_slope": 0.0}, "name": "block_4_expand_relu", "inbound_nodes": [[["block_4_expand_BN", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"data_format": "channels_last", "trainable": false, "depth_multiplier": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "name": "block_4_depthwise", "kernel_size": [3, 3], "activity_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "depthwise_regularizer": null, "dtype": "float32", "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block_4_depthwise", "inbound_nodes": [[["block_4_expand_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "block_4_depthwise_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "block_4_depthwise_BN", "inbound_nodes": [[["block_4_depthwise", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "block_4_depthwise_relu", "dtype": "float32", "threshold": 0.0, "trainable": false, "max_value": 6.0, "negative_slope": 0.0}, "name": "block_4_depthwise_relu", "inbound_nodes": [[["block_4_depthwise_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"groups": 1, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "filters": 32, "use_bias": false, "name": "block_4_project", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block_4_project", "inbound_nodes": [[["block_4_depthwise_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "block_4_project_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "block_4_project_BN", "inbound_nodes": [[["block_4_project", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block_4_add", "dtype": "float32", "trainable": false}, "name": "block_4_add", "inbound_nodes": [[["block_3_project_BN", 0, 0, {}], ["block_4_project_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"groups": 1, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "filters": 192, "use_bias": false, "name": "block_5_expand", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block_5_expand", "inbound_nodes": [[["block_4_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "block_5_expand_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "block_5_expand_BN", "inbound_nodes": [[["block_5_expand", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "block_5_expand_relu", "dtype": "float32", "threshold": 0.0, "trainable": false, "max_value": 6.0, "negative_slope": 0.0}, "name": "block_5_expand_relu", "inbound_nodes": [[["block_5_expand_BN", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"data_format": "channels_last", "trainable": false, "depth_multiplier": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "name": "block_5_depthwise", "kernel_size": [3, 3], "activity_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "depthwise_regularizer": null, "dtype": "float32", "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block_5_depthwise", "inbound_nodes": [[["block_5_expand_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "block_5_depthwise_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "block_5_depthwise_BN", "inbound_nodes": [[["block_5_depthwise", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "block_5_depthwise_relu", "dtype": "float32", "threshold": 0.0, "trainable": false, "max_value": 6.0, "negative_slope": 0.0}, "name": "block_5_depthwise_relu", "inbound_nodes": [[["block_5_depthwise_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"groups": 1, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "filters": 32, "use_bias": false, "name": "block_5_project", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block_5_project", "inbound_nodes": [[["block_5_depthwise_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "block_5_project_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "block_5_project_BN", "inbound_nodes": [[["block_5_project", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block_5_add", "dtype": "float32", "trainable": false}, "name": "block_5_add", "inbound_nodes": [[["block_4_add", 0, 0, {}], ["block_5_project_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"groups": 1, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "filters": 192, "use_bias": false, "name": "block_6_expand", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block_6_expand", "inbound_nodes": [[["block_5_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "block_6_expand_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "block_6_expand_BN", "inbound_nodes": [[["block_6_expand", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "block_6_expand_relu", "dtype": "float32", "threshold": 0.0, "trainable": false, "max_value": 6.0, "negative_slope": 0.0}, "name": "block_6_expand_relu", "inbound_nodes": [[["block_6_expand_BN", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "block_6_pad", "dtype": "float32", "data_format": "channels_last", "trainable": false, "padding": [[0, 1], [0, 1]]}, "name": "block_6_pad", "inbound_nodes": [[["block_6_expand_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"data_format": "channels_last", "trainable": false, "depth_multiplier": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "name": "block_6_depthwise", "kernel_size": [3, 3], "activity_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_regularizer": null, "depthwise_regularizer": null, "dtype": "float32", "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dilation_rate": [1, 1], "strides": [2, 2]}, "name": "block_6_depthwise", "inbound_nodes": [[["block_6_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "block_6_depthwise_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "block_6_depthwise_BN", "inbound_nodes": [[["block_6_depthwise", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "block_6_depthwise_relu", "dtype": "float32", "threshold": 0.0, "trainable": false, "max_value": 6.0, "negative_slope": 0.0}, "name": "block_6_depthwise_relu", "inbound_nodes": [[["block_6_depthwise_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"groups": 1, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "filters": 64, "use_bias": false, "name": "block_6_project", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block_6_project", "inbound_nodes": [[["block_6_depthwise_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "block_6_project_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "block_6_project_BN", "inbound_nodes": [[["block_6_project", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"groups": 1, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "filters": 384, "use_bias": false, "name": "block_7_expand", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block_7_expand", "inbound_nodes": [[["block_6_project_BN", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "block_7_expand_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "block_7_expand_BN", "inbound_nodes": [[["block_7_expand", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "block_7_expand_relu", "dtype": "float32", "threshold": 0.0, "trainable": false, "max_value": 6.0, "negative_slope": 0.0}, "name": "block_7_expand_relu", "inbound_nodes": [[["block_7_expand_BN", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"data_format": "channels_last", "trainable": false, "depth_multiplier": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "name": "block_7_depthwise", "kernel_size": [3, 3], "activity_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "depthwise_regularizer": null, "dtype": "float32", "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block_7_depthwise", "inbound_nodes": [[["block_7_expand_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "block_7_depthwise_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "block_7_depthwise_BN", "inbound_nodes": [[["block_7_depthwise", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "block_7_depthwise_relu", "dtype": "float32", "threshold": 0.0, "trainable": false, "max_value": 6.0, "negative_slope": 0.0}, "name": "block_7_depthwise_relu", "inbound_nodes": [[["block_7_depthwise_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"groups": 1, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "filters": 64, "use_bias": false, "name": "block_7_project", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block_7_project", "inbound_nodes": [[["block_7_depthwise_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "block_7_project_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "block_7_project_BN", "inbound_nodes": [[["block_7_project", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block_7_add", "dtype": "float32", "trainable": false}, "name": "block_7_add", "inbound_nodes": [[["block_6_project_BN", 0, 0, {}], ["block_7_project_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"groups": 1, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "filters": 384, "use_bias": false, "name": "block_8_expand", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block_8_expand", "inbound_nodes": [[["block_7_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "block_8_expand_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "block_8_expand_BN", "inbound_nodes": [[["block_8_expand", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "block_8_expand_relu", "dtype": "float32", "threshold": 0.0, "trainable": false, "max_value": 6.0, "negative_slope": 0.0}, "name": "block_8_expand_relu", "inbound_nodes": [[["block_8_expand_BN", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"data_format": "channels_last", "trainable": false, "depth_multiplier": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "name": "block_8_depthwise", "kernel_size": [3, 3], "activity_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "depthwise_regularizer": null, "dtype": "float32", "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block_8_depthwise", "inbound_nodes": [[["block_8_expand_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "block_8_depthwise_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "block_8_depthwise_BN", "inbound_nodes": [[["block_8_depthwise", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "block_8_depthwise_relu", "dtype": "float32", "threshold": 0.0, "trainable": false, "max_value": 6.0, "negative_slope": 0.0}, "name": "block_8_depthwise_relu", "inbound_nodes": [[["block_8_depthwise_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"groups": 1, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "filters": 64, "use_bias": false, "name": "block_8_project", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block_8_project", "inbound_nodes": [[["block_8_depthwise_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "block_8_project_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "block_8_project_BN", "inbound_nodes": [[["block_8_project", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block_8_add", "dtype": "float32", "trainable": false}, "name": "block_8_add", "inbound_nodes": [[["block_7_add", 0, 0, {}], ["block_8_project_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"groups": 1, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "filters": 384, "use_bias": false, "name": "block_9_expand", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block_9_expand", "inbound_nodes": [[["block_8_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "block_9_expand_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "block_9_expand_BN", "inbound_nodes": [[["block_9_expand", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "block_9_expand_relu", "dtype": "float32", "threshold": 0.0, "trainable": false, "max_value": 6.0, "negative_slope": 0.0}, "name": "block_9_expand_relu", "inbound_nodes": [[["block_9_expand_BN", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"data_format": "channels_last", "trainable": false, "depth_multiplier": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "name": "block_9_depthwise", "kernel_size": [3, 3], "activity_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "depthwise_regularizer": null, "dtype": "float32", "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block_9_depthwise", "inbound_nodes": [[["block_9_expand_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "block_9_depthwise_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "block_9_depthwise_BN", "inbound_nodes": [[["block_9_depthwise", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "block_9_depthwise_relu", "dtype": "float32", "threshold": 0.0, "trainable": false, "max_value": 6.0, "negative_slope": 0.0}, "name": "block_9_depthwise_relu", "inbound_nodes": [[["block_9_depthwise_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"groups": 1, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "filters": 64, "use_bias": false, "name": "block_9_project", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block_9_project", "inbound_nodes": [[["block_9_depthwise_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "block_9_project_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "block_9_project_BN", "inbound_nodes": [[["block_9_project", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block_9_add", "dtype": "float32", "trainable": false}, "name": "block_9_add", "inbound_nodes": [[["block_8_add", 0, 0, {}], ["block_9_project_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"groups": 1, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "filters": 384, "use_bias": false, "name": "block_10_expand", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block_10_expand", "inbound_nodes": [[["block_9_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "block_10_expand_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "block_10_expand_BN", "inbound_nodes": [[["block_10_expand", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "block_10_expand_relu", "dtype": "float32", "threshold": 0.0, "trainable": false, "max_value": 6.0, "negative_slope": 0.0}, "name": "block_10_expand_relu", "inbound_nodes": [[["block_10_expand_BN", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"data_format": "channels_last", "trainable": false, "depth_multiplier": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "activation": "linear", "use_bias": false, "name": "block_10_depthwise", "kernel_size": [3, 3], "activity_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "depthwise_regularizer": null, "dtype": "float32", "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block_10_depthwise", "inbound_nodes": [[["block_10_expand_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_regularizer": null, "trainable": false, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "block_10_depthwise_BN", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.999, "center": true, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "block_10_depthwise_BN", "inbound_nodes": [[["block_10_depthwise", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "block_10_depthwise_relu", "dtype": "float32", "threshold": 0.0, "trainable": false, "max_value": 6.0, "negative_slope": 0.0}, "name": "block_10_depthwise_relu", "inbound_nodes": [[["block_10_depthwise_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"groups": 1, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "filters": 96, "use_bias": false, "name": "block_10_project", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "padding": "same", 